#+TITLE: Lecture 5A: Assignment, State, and Side-effects
#+AUTHOR: Fabricio Puente Mansilla
#+DATE: <2026-01-17 Sat>
#+STARTUP: indent overview
#+PROPERTY: header-args:elisp :lexical t

** Approach B: Imperative (With Assignment)
We hide the seed inside a ~rand~ function. The math functions just
call ~(rand)~.

#+BEGIN_SRC elisp :results output
  ;; 1. The Random Number Generator (Encapsulated State)
  ;; We use a closure to hide 'x' (the seed)
  (setq rand
        (let ((x 1))
          (lambda ()
            (setq x (mod (* x 16807) 2147483647))
            x)))

  ;; 2. Cesaro's Experiment (The Math)
  ;; Note: GCD is built-in to Emacs 26+, or cl-lib.
  ;; We'll use a simple recursive GCD here just in case.
  (defun my-gcd (a b)
    (if (= b 0) a (my-gcd b (mod a b))))

  (defun cesaro-test ()
    (= (my-gcd (funcall rand) (funcall rand)) 1))

  ;; 3. Monte Carlo Solver (Generic)
  (defun monte-carlo (trials experiment)
    (let ((passed 0))
      (dotimes (i trials)
        (if (funcall experiment)
            (setq passed (1+ passed))))
      ;; Return probability (float)
      (/ (float passed) trials)))

  ;; 4. Estimate Pi
  (defun estimate-pi (trials)
    (sqrt (/ 6.0 (monte-carlo trials 'cesaro-test))))

  ;; Run it!
  (print (format "Pi Estimate (1000 trials): %f" (estimate-pi 1000)))
#+END_SRC

#+RESULTS:
: "Pi Estimate (1000 trials): 3.136250"

*Takeaway:* The ~monte-carlo~ function is beautiful and clean. It
doesn't know about "random seeds" or "state". It just runs an
experiment. This modularity is why we accept the complexity of
assignment.

